//1.
let a = 1, b = 1;

let c = ++a; // 2
let d = b++; // 1

//2.
let e = 2;

let x = 1 + (e *= 2); // e=4 x=5

//3.
"" + 1 + 0 //10
"" - 1 + 0 //-1
true + false //1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" //"9px"
"$" + 4 + 5 //"$45"
"4" - 2 //2
"4px" - 2 //NaN
7 / 0 //Infinity
"  -9  " + 5 //" -9 5"
"  -9  " - 5 //-14
null + 1 //1
undefined + 1 //NaN
" \t \n" - 2 //-2

//4.
let f = prompt("덧셈할 첫 번째 숫자를 입력해주세요.", 1);
let g = prompt("덧셈할 두 번째 숫자를 입력해주세요.", 2);

alert(+f + +g); // 1

// 의도한 대로 덧셈이 되지 않는 이유는 prompt 함수가 사용자 입력을 문자열로 반환하기 때문입니다.
